#+TITLE:Emacs Config README

This file initially served as my init file, tangled into init.el using org-babel. Now it serves to document my distributed init files.



*** [[https://github.com/rnkn/olivetti][Olivetti mode]]
#+BEGIN_SRC emacs-lisp
  (use-package olivetti
    :ensure t
)
 #+END_SRC

 #+RESULTS:
 : Text body width set to 100

*** Fonts and sizes
#+BEGIN_SRC emacs-lisp
  (custom-theme-set-faces
     'user
     `(org-level-8        ((t (:inherit default :weight bold :foreground "#f5f5f5"))))
     `(org-level-7        ((t (:inherit default :weight bold :foreground "#f5f5f5"))))
     `(org-level-6        ((t (:inherit default :weight bold :foreground "#f5f5f5"))))
     `(org-level-5        ((t (:inherit default :weight bold :foreground "#f5f5f5"))))
     `(org-level-4        ((t (:inherit default :weight bold :height 1.125 :foreground "#f5f5f5"))))
     `(org-level-3        ((t (:inherit default :weight bold :height 1.25 :foreground "#f5f5f5"))))
     `(org-level-2        ((t (:inherit default :weight bold :height 1.375 :foreground "#f5f5f5"))))
     `(org-level-1        ((t (:inherit default :weight bold :height 1.5 :foreground "#f5f5f5"))))
     `(org-document-title ((t (:inherit default :weight bold :height 2.0 :underline t :foreground "#f5f5f5"))))
     '(org-block                 ((t (:inherit fixed-pitch))))
     '(org-document-info         ((t (:inherit fixed-pitch :foreground "dark orange"))))
     '(org-document-info-keyword ((t (:inherit fixed-pitch))))
     '(org-link                  ((t (:foreground "royal blue" :underline t))))
     '(org-meta-line             ((t (:inherit (font-lock-comment-face fixed-pitch)))))
     '(org-property-value        ((t (:inherit fixed-pitch))) t)
     '(org-special-keyword       ((t (:inherit (font-lock-comment-face fixed-pitch)))))
     '(org-tag                   ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
     '(org-verbatim              ((t (:inherit (shadow fixed-pitch)))))
     '(org-priority              ((t (:inherit fixed-pitch))))
     '(org-todo                  ((t (:inherit fixed-pitch))))
     '(org-done                  ((t (:inherit fixed-pitch))))
     '(org-table                 ((t (:inherit fixed-pitch))))
     )
#+END_SRC

#+RESULTS:
: 0

[[https://ogbe.net/blog/toggle-serif.html][a mix of variable and fixed pitch fonts]]?
*** Org-babel
 #+BEGIN_SRC emacs-lisp
   (setq exec-path (append exec-path '("/home/francis/Programs/anaconda3/bin")))

   (org-babel-do-load-languages
    'org-babel-load-languages
    '((python . t)
      (shell . t)
      (emacs-lisp . t)
      (ipython . t)
      (plantuml . t))
    )

   (setq org-plantuml-jar-path "/usr/share/plantuml/plantuml.jar")
   ;; Use fundamental mode when editing plantuml blocks
   (add-to-list 'org-src-lang-modes (quote ("plantuml" . fundamental)))
 #+END_SRC

 #+RESULTS:
 : ((plantuml . fundamental) (jupyter-python . python) (ipython . python) (ocaml . tuareg) (elisp . emacs-lisp) (ditaa . artist) (asymptote . asy) (dot . fundamental) (sqlite . sql) (calc . fundamental) (C . c) (cpp . c++) (C++ . c++) (screen . shell-script) (shell . sh) (bash . sh))
